In [1]:
import pandas as pd

## 예제 8-7  eval 함수와 메소드 처리하기

In [2]:
import numpy as np

In [3]:
rng = np.random.RandomState(42)

In [4]:
nrows, ncols = 100000, 10

In [5]:
print(type(pd.DataFrame(rng.rand(nrows, ncols)) for i in range(2)))

In [6]:
df1, df2 = (pd.DataFrame(rng.rand(nrows, ncols))for i in range(2))

In [7]:
%timeit df1 + df2

In [8]:
%timeit pd.eval('df1 + df2')

In [9]:
np.allclose(df1 + df2 ,pd.eval('df1 + df2 '))

In [10]:
nrows1, ncols1 = 100000, 100

In [11]:
df11, df12,df13, df14 = (pd.DataFrame(rng.rand(nrows1, ncols1))for i in range(4))

In [12]:
%timeit df11 + df12 + df13 + df14

192 ms ± 12 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [13]:
%timeit pd.eval('df11 + df12 + df13 + df14')

87 ms ± 7.27 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [204]:
dfa1 = pd. DataFrame(np.random.randn(10, 2), columns=['평균','분산'])

In [205]:
dfa1

         평균        분산
0  0.839799 -0.814694
1 -0.234363  1.324467
2  0.144717 -1.736778
3 -0.972202  1.313208
4  1.044393 -0.690049
5  1.083735 -1.005838
6  0.876006 -0.905506
7 -0.471319 -0.176259
8 -0.153987  2.257781
9 -0.274270  0.086036

In [206]:
dfa1.eval( '평균 + 분산 ')

0    0.025105
1    1.090104
2   -1.592061
3    0.341007
4    0.354344
5    0.077897
6   -0.029500
7   -0.647578
8    2.103794
9   -0.188234
dtype: float64

In [211]:
dfa1.eval( '편차  = 평균 - 분산 ')

         평균        분산        편차
0  0.839799 -0.814694  1.654493
1 -0.234363  1.324467 -1.558829
2  0.144717 -1.736778  1.881495
3 -0.972202  1.313208 -2.285410
4  1.044393 -0.690049  1.734442
5  1.083735 -1.005838  2.089573
6  0.876006 -0.905506  1.781512
7 -0.471319 -0.176259 -0.295060
8 -0.153987  2.257781 -2.411768
9 -0.274270  0.086036 -0.360306

In [208]:
dfa1

         평균        분산
0  0.839799 -0.814694
1 -0.234363  1.324467
2  0.144717 -1.736778
3 -0.972202  1.313208
4  1.044393 -0.690049
5  1.083735 -1.005838
6  0.876006 -0.905506
7 -0.471319 -0.176259
8 -0.153987  2.257781
9 -0.274270  0.086036

In [209]:
dfa1.eval( '편차 = 평균 - 분산 ', inplace=True)

In [210]:
dfa1

         평균        분산        편차
0  0.839799 -0.814694  1.654493
1 -0.234363  1.324467 -1.558829
2  0.144717 -1.736778  1.881495
3 -0.972202  1.313208 -2.285410
4  1.044393 -0.690049  1.734442
5  1.083735 -1.005838  2.089573
6  0.876006 -0.905506  1.781512
7 -0.471319 -0.176259 -0.295060
8 -0.153987  2.257781 -2.411768
9 -0.274270  0.086036 -0.360306

In [21]:
dfa2 = pd. DataFrame(np.random.randn(10, 2), columns=range(0,2))

In [22]:
dfa2

          0         1
0  0.042332 -0.586918
1  0.218248 -0.221298
2 -0.858814 -1.603962
3 -2.473903 -0.578440
4 -1.087972  1.934073
5 -1.303544  0.649806
6  0.428765  0.678743
7  1.196834 -1.026760
8  0.262025 -0.075616
9 -1.289332  1.054781

In [23]:
dfa2.eval( '0 +1 ')

1

In [24]:
try :
    pd.eval('dfa2.0 + dfa2.1')
except Exception as e  :
    print("exception ", e)

exception  invalid syntax (<unknown>, line 1)

In [25]:
try :
    df_add = pd.eval('dfa2[0] + dfa2[1]')
except Exception as e  :
    print("exception ", e)

In [26]:
df_add

0   -0.544586
1   -0.003051
2   -2.462775
3   -3.052344
4    0.846101
5   -0.653738
6    1.107508
7    0.170074
8    0.186409
9   -0.234551
dtype: float64

In [27]:
df1, df2, df3, df4, df5 = (pd.DataFrame(rng.randint(0, 1000, (100, 3)))
                           for i in range(5))

In [28]:
result1 = -df1 * df2 / (df3 + df4) - df5

In [29]:
result2 = pd.eval('-df1 * df2 / (df3 + df4) - df5')

In [30]:
np.allclose(result1, result2)

True

In [31]:
result1 = (df1 < 0.5) & (df2 < 0.5) | (df3 < df4)

In [32]:
result2 = pd.eval('(df1 < 0.5) & (df2 < 0.5) | (df3 < df4)')

In [33]:
np.allclose(result1, result2)

True

In [34]:
result3 = pd.eval('(df1 < 0.5) and (df2 < 0.5) or (df3 < df4)')

In [35]:
np.allclose(result1, result3)

True

In [36]:
result1 = df2.T[0] + df3.iloc[1]

In [37]:
result2 = pd.eval('df2.T[0] + df3.iloc[1]')

In [38]:
np.allclose(result1, result2)

True

In [84]:
df = pd. DataFrame(np.random.randn(10, 2), columns=list('AB'))

In [90]:
column_mean = df.mean(axis=1)

In [91]:
column_mean.head()

0   -0.185987
1   -1.569684
2   -0.378890
3    1.204280
4   -0.150269
dtype: float64

In [92]:
result1 = df['A'] + column_mean

In [93]:
result2 = df.eval('A + @column_mean')

In [94]:
np.allclose(result1, result2)

True

## 예제 8-8  query 함수와 메소드 처리하기

In [50]:
dfq1 = pd. DataFrame(np.random.randn(10, 2), columns=list('ab'))

In [51]:
dfq1

          a         b
0 -1.270029  0.355593
1 -0.886952  0.645808
2 -0.093719 -1.989059
3  0.154771 -0.079927
4  0.472608 -1.406375
5  1.815199 -0.468221
6 -1.352205  0.340897
7 -1.359580  0.437599
8 -0.504591 -2.854716
9 -0.088792  1.726316

In [52]:
dfq1.query('a < b')

          a         b
0 -1.270029  0.355593
1 -0.886952  0.645808
6 -1.352205  0.340897
7 -1.359580  0.437599
9 -0.088792  1.726316

In [53]:
try :
    dfq1.query('c = a < b',inplace=True)
except Exception as e :
    print('Exception :', e)

Exception : cannot assign without a target object

In [54]:
dfq1.query('a < b')

          a         b
0 -1.270029  0.355593
1 -0.886952  0.645808
6 -1.352205  0.340897
7 -1.359580  0.437599
9 -0.088792  1.726316

In [55]:
dfq1[dfq1.a < dfq1.b]

          a         b
0 -1.270029  0.355593
1 -0.886952  0.645808
6 -1.352205  0.340897
7 -1.359580  0.437599
9 -0.088792  1.726316

In [56]:
df_q2 = dfq1.query('a < b')

In [57]:
df_q2

          a         b
0 -1.270029  0.355593
1 -0.886952  0.645808
6 -1.352205  0.340897
7 -1.359580  0.437599
9 -0.088792  1.726316

In [175]:
df = pd. DataFrame(np.random.randn(10, 2), columns=list('가나'))

In [176]:
result1 = df[(df.가 < 0.5) & (df.나 < 0.5)]

In [177]:
result2 = pd.eval('df[(df.가 < 0.5) & (df.나 < 0.5)]')

In [178]:
np.allclose(result1, result2)

True

In [179]:
result3 = df.query('가 < 0.5 and 나 < 0.5')

In [180]:
np.allclose(result1, result3)

True

In [182]:
Bmean = df['나'].mean()

In [148]:
Bmean

-0.008524468398871577

In [183]:
(df.가 < Bmean) & (df.나 < Bmean)

0     True
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [184]:
result11 = df[(df.가 < Bmean) & (df.나 < Bmean)]

In [185]:
result11.shape

(2, 2)

In [186]:
result11

          가         나
0 -2.421679 -1.327923
3 -1.286841 -2.328234

In [187]:
result12 = df.query("(가 < @Bmean) & (나 < @Bmean)")

In [188]:
result12.shape

(2, 2)

In [189]:
result12

          가         나
0 -2.421679 -1.327923
3 -1.286841 -2.328234

In [190]:
np.allclose(result11, result12)

True

In [191]:
a = list('가나다라마바')

In [192]:
b = range(6)

In [193]:
df_ = pd.DataFrame({'X':pd.Series(a),'Y': pd.Series(b)})

In [194]:
df_

   X  Y
0  가  0
1  나  1
2  다  2
3  라  3
4  마  4
5  바  5

In [195]:
df_Y = df_.query('Y < 3')

In [196]:
df_Y

   X  Y
0  가  0
1  나  1
2  다  2

In [197]:
import numexpr as ne

In [198]:
ne_works = ne.evaluate('"가" < "라"')

In [199]:
ne_works

array(True)

In [203]:
df_.X < '라'

0     True
1     True
2     True
3    False
4    False
5    False
Name: X, dtype: bool

In [200]:
df_X = df_.query('X < "라"')

In [201]:
df_X

   X  Y
0  가  0
1  나  1
2  다  2